// for (let i = 1(ітератор); умова; i ++ (пост-вираз)) {
//     Тіло з інструкціями що робити
// }

for(let i = 1; i <= 5; i ++) {
    console.log(`Цикл вивів рядок номер ${i}`)
}

// 1 Цикл for запускається і створює змінну i зі значенням 1
// 2 for перевіряє умову i <= 5, тобто 1 <= 5, буде true
// 3 оскільки в умові true виконається код у фігурних дужках
// 4 спрацьовує пост вираз i += 1, тобто 1 += 1, ТОБТО В І ВЖЕ БУДЕ 2
// 5 цикл переходить на наступну ітерацію (повторюється) ; тепер в i лежить 2
// 6 for перевіряє умову i <= 5, тобто 2 <= 5, буде true
// 7 оскільки в умові true виконається код у фігурних дужках
// 8 спрацьовує пост вираз i += 1, тобто 2 += 1, ТОБТО В І ВЖЕ БУДЕ 3
// 9 цикл переходить на наступну ітерацію (повторюється) ; тепер в i лежить 3
// 10 for перевіряє умову i <= 5, тобто 3 <= 5, буде true
// 11 оскільки в умові true виконається код у фігурних дужках
// 12 спрацьовує пост вираз i += 1, тобто 3 += 1, ТОБТО В І ВЖЕ БУДЕ 4
// 13 for перевіряє умову i <= 5, тобто 4 <= 5, буде true
// 14 оскільки в умові true виконається код у фігурних дужках
// 15 спрацьовує пост вираз i += 1, тобто 4 += 1, ТОБТО В І ВЖЕ БУДЕ 5
// 16 for перевіряє умову i <= 5, тобто 5 <= 5, буде true
// 17 оскільки в умові true виконається код у фігурних дужках
// 18 спрацьовує пост вираз i += 1, тобто 5 += 1, ТОБТО В І ВЖЕ БУДЕ 6
// 19 цикл переходить на наступну ітерацію (повторюється) ; тепер в i лежить 6
// 20 for перевіряє умову i <= 5, тобто 6 <= 5, буде false
// 21 Оскільки в умові буде false то цикл припиниться (фігурні дужки не виконуються)


// const min = parseInt(prompt("Введіть мінімальне число:"));
// const max = parseInt(prompt("Введіть максимальне число:"));
// let sum = 0;
// for (let i = min; i <= max; i++) {
//     if (i % 2 === 0) {
//         sum += i;
//     }
// }
// console.log(`Сума всіх парних чисел від ${min} до ${max} дорівнює ${sum}.`);


// const userNumber = Number(prompt(`Яке число ви бажаєте знайти у проміжку між ${min}`))

// let i = min;
// while (i !== userNumber) {
//     console.log(`${i} не те число яке ви шукаєте`)
//     i++;3
// }

// console.log(`Ви знайшли число ${userNumber}`)

// while (i <= max) {
//     if (i === userNumber) {
//         console.log(`Ми знайшли ${userNumber}`)
//         break
// }
//   i++ 
// }
 

const savePassword = '112233';

let enterPassword; 
do {
    enterPassword = prompt("Введіть пароль")
} while (enterPassword !== savePassword)
    alert("Вітаю ви залогінені") 